CD2DSizeU.op_Implicit~CSize
Converts CD2DSizeU to CSize object.
Returns:
Current value of D2D size.

CD2DSizeU.IsNull
Returns a Boolean value that indicates whether an expression contains no valid data (Null).
Returns:
TRUE if width and height are empty; otherwise FALSE.

CD2DSizeU.#ctor(System.UInt32,System.UInt32)
Constructs a CD2DSizeU object from two UINT32 values.
cx: source width
cy: source height

CD2DSizeU.#ctor(D2D_SIZE_U!System.Runtime.CompilerServices.IsConst*)
Constructs a CD2DSizeU object from D2D1_SIZE_U object.
size: source size

CD2DSizeU.#ctor(D2D_SIZE_U!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructs a CD2DSizeU object from D2D1_SIZE_U object.
size: source size

CD2DSizeU.#ctor(CSize!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructs a CD2DSizeU object from CSize object.
size: source size

CD2DSizeU
D2D1_SIZE_U wrapper